const wordsSource = {
    "流行语": [
        "请客，斩首，留下当狗", "让子弹再飞一会儿",
        "这TM8岁？", "布，嘌呤半生...公若不弃，布愿拜为义父",
        "宫廷玉液酒，一百八一杯", "你跺你也麻", "you jump i jump",
        "敢杀我的马？", "我们是冠军", "退！退！退！", "听我说谢谢你",
        "燕子，没有你我可怎么活啊！", "你是故意找茬是不是", "啊哈哈哈...鸡汤来喽",
        "你所热爱的，就是你的生活", "我赌你的枪里没有子弹", "取汝首级如同探囊取物",
        "我不到啊", "这是谁的部将", "让我看看！", "到达世界最高层，理塘", "雪糕刺客",
        "麦乐鸡侠", "内卷", "我可能不是人，但你是真的狗", "我柜子动了，我不玩了",
        "快跑啊傻孩子们", "前方可是地狱啊", "冰冻罗非鱼", "creeper?", "你行你上",
        "皮皮虾我们走", "我不做人了!", "大力出奇迹", "年轻人不要太气盛", "鸡你太美"
    ],
    '运动': ["跑步", "游泳", "篮球", "排球", "羽毛球", "拳击",
        "轮滑", "乒乓球", "网球", "健步走"
        , "跑酷", "攀岩", "高尔夫", "舞蹈"
        , "举重", "马拉松", "瑜伽", "太极拳", "滑雪"
        , "广播体操", "军体拳", "蛙跳", "深蹲", "俯卧撑"
        , "引体向上", "立定跳远", "实心球", "标枪", "射箭"
        , "撑杆跳", "仰卧起坐", "倒立", "跳水"],
    '生物': ["苍蝇", "蚊子", "老鼠", "猫", "狗",
        "蛇", "鲨鱼", "鳄鱼", "鲸鱼", "鹰", "龙",
        "马", "企鹅", "老虎", "狮子"
        , "鹿", "狼", "袋鼠", "羊", "鸭子"
        , "鹅", "飞蛾", "猪", "猩猩", "猴子",
        "蚂蚱", "蜜蜂", "蜻蜓", "跳蚤", "青蛙",
        "牛", "史莱姆", "哥布林", "大象", "火鸡"],
    '职业': ["工人", "农民", "快递员", "外卖员", "程序员",
        "公务员", "军人", "消防员", "警察", "保安",
        "学生", "教师", "厨师", "屠夫", "清洁工",
        "服务员", "工程师", "科学家", "医生", "护士"
        , "律师", "经纪人", "经理", "歌手", "法官"
        , "飞行员", "司机", "售票员", "盗贼", "刺客",
        "理发师", "战士", "法师", "道士", "祭司"],
    '工具': ["镰刀", "小刀", "剪刀", "螺丝刀", "刻刀",
        "扫把", "拖把", "暖壶", "牙刷", "自行车"
        , "桌子", "凳子", "自行车", "公交车", "垃圾桶"
        , "纸巾", "胶水", "电脑", "筷子", "勺子"
        , "牙签", "衣架", "镜子", "打火机", "玩具车"
        , "手机", "灯泡", "衣柜", "胶带", "绷带"
        , "创可贴", "键盘", "水龙头", "消防栓", "千斤顶"
        , "汽车", "地铁", "三轮车", "雨伞", "铅笔"
        , "钢笔", "耳机", "耳塞", "笔记本", "书包"],
    '人物': ["杜甫", "李白", "诸葛亮", "孙悟空", "唐僧",
        "杨戬", "元首", "王司徒", "李逵", "唐三",
        "孙策", "夏侯惇", "吕布", "空条承太郎", "dio",
        "张角", "亚瑟", "路飞", "旋涡鸣人", "宫本武藏",
        "刑天", "观音", "玉皇大帝", "如来佛祖", "牛魔王",
        "关羽", "张飞", "盘古", "上帝", "撒旦",
        "亚索", "腕豪", "剑魔", "阿尼亚", "波吉",
        "琦玉", "李小龙", "至尊宝", "猪八戒", "沙和尚"
    ],
    '食物': ["苹果", "梨", "香蕉", "火龙果", "草莓",
        "葡萄", "西瓜", "桃子", "杏", "樱桃",
        "蓝莓", "猕猴桃", "花生", "橘子", "瓜子",
        "西红柿", "黄瓜", "白菜", "生菜", "韭菜",
        "小麦", "胡萝卜", "白萝卜", "甜菜", "菠菜",
        "莴苣", "茄子", "扇贝", "鲍鱼", "排骨",
        "五花肉", "豆腐", "鸡肉", "面条", "包子",
        "米饭", "馒头", "花卷", "鸡蛋", "牛奶",
        "饼干", "蛋糕", "糖果", "丸子", "花菜",]

}
// 乱序
function shuffle(a) {
    for (let i = a.length; i; i--) {
        let j = Math.floor(Math.random() * i);
        [a[i - 1], a[j]] = [a[j], a[i - 1]];
    }
    return a;
}
export function getWords(type, number) {
    const words = shuffle(wordsSource[type])
    return words.slice(0, number)
}
export function getKeys() {
    return Object.keys(wordsSource)
}
